#include<iostream>
using namespace std;
int n,m;
int a[12][12];
int h[12][12],l[12][12],x[12][12];//都是起vis数组的作用
const int xiao[12][12]={{0,0,0,0,0,0,0,0,0,0},
                        {0,1,1,1,2,2,2,3,3,3},  
                        {0,1,1,1,2,2,2,3,3,3},
                        {0,1,1,1,2,2,2,3,3,3},
                        {0,4,4,4,5,5,5,6,6,6},
                        {0,4,4,4,5,5,5,6,6,6},   
                        {0,4,4,4,5,5,5,6,6,6},
                        {0,7,7,7,8,8,8,9,9,9},
                        {0,7,7,7,8,8,8,9,9,9},
                        {0,7,7,7,8,8,8,9,9,9}};
struct ty
{
    int x,y;
}kong[90];//定义了一个专门用来存空位的结构体数组
int cnt=0;
void print()
{
    for(int i=1;i<=9;i++)
    {
        for(int j=1;j<=9;j++)
        {
            cout<<a[i][j]<<" ";
        }
        cout<<endl;
    }
}
void dfs(int dep)
{
    if(dep>cnt)
    {
        print();
        return;
    }
    int xx=kong[dep].x;//注意，这里的kong数组里面存了数独中所有为零的坐标，dep用来搜索每一个为零的空位的可能性
    int yy=kong[dep].y;
    for(int i=1;i<=9;i++)
    {
        if(h[xx][i]==0&&l[yy][i]==0&&x[xiao[kong[dep].x][yy]][i]==0)//这告诉我们二维数组的作用实际上有很多，远远不止行列这种表达的意思，还可以直接让前面一个表示坐标，后面一个表示填入的数字
        {
            a[xx][yy]=i;//在空位(xx,yy)填入数字i
            h[xx][i]=1;//标记数字i已经出现在当前行
            l[yy][i]=1;//标记数字i已经出现在当前列
            x[xiao[xx][yy]][i]=1;//标记数字i已经出现在当前子块
            //也就是说，这三个数组前一个村的都是具体的位置，而不是数值
            dfs(dep+1);
            h[xx][i]=0;
            l[yy][i]=0;
            x[xiao[xx][yy]][i]=0;
        }
    }
}

int main()
{
    for(int i=1;i<=9;i++)
    {
        for(int j=1;j<=9;j++)
        {
            cin>>a[i][j];
            if(a[i][j]==0)
            {
                kong[++cnt].x=i;
                kong[cnt].y=j;
            }
            else
            {
                h[i][a[i][j]]=1;//注意，这里使用二维数组不是代表一个具体的行或者列，前一个表示这个数独的第几行或者第几列，后一个表示这个地方是哪个数
                l[j][a[i][j]]=1;//记录数字已经在第j列
                x[xiao[i][j]][a[i][j]]=1;//记录数字已经在对应的子块中
            }
        }
    }
    dfs(1);
    return 0;
}
